package class1;

public class ClassStart2 {
	public static void main(String[] args) {
		
		String[] students = {"홍길동", "장발장", "임꺽정", "로미오"};
		int[] stuage = {15, 16, 17, 20};
		int[] grade = {90, 80, 99, 70};	
		for(int i = 0; i < students.length; i++) {
			System.out.println("이름: "+students[i]+" 나이: "+stuage[i]+"세 성적: "+grade[i]+"점");
		}
		// 배열을 사용하여 코드를 다시 작성하였을 때
		// 1. 학생이 추가되어도 배열에 데이터만 추가하면 됨. 변수 추가X
		// 2. 출력을 반복문을 통해 배열을 순차적으로 탐색하므로, 학생이 추가되어도 출력코드를 추가할 필요가 없다.
		// 코드 번경은 최소화 되었으나, 한 학생의 데이터가 3개의 배열로 나눠서 관리가 됨.
		// 데이터를 변경, 삭제할 때 매우 조심히 작업을 해야함.
		// 컴퓨터가 볼 때는 전혀 문제가 없지만, 사람이 관리하기에는 좋은 코드가 아니다.
		// 그래서 클래스를 도입 클래스를 사용하여 학생이라는 개념을 만들고
		// 각각의 학생별로 본인의 이름, 나이, 성적을 관리함.
		
		
	}
}
